Конфигурация/Catalogs/БанковскиеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>БанковскиеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидБанковскогоСчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыБанковскихСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУправленияДовереннымиСредствами</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетТипаС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанкДляРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДоговораМНО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстКорреспондента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстНазначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Транзитный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранзитныйПИФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорМНО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомерФилиалаКредитнойОрганизации</Name>
					<Comment>Указывается для филиалов, </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорЦессии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Catalogs/БанковскиеСчета/Forms/ФормаВыбораИзИсполнителей/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыФормы = ЭтаФорма.Параметры;
	
	Если ПараметрыФормы.ВозвращатьВсеСведенияОбИсполнителе Тогда
		Элементы.СтраницаПолныйСписок.Видимость    = Ложь;
		Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	КонецЕсли;
	
	// в зависимости параметра доступен выбор исполнителей отпределенного вида
	ЭтаФорма.ВыборИсполнителейБрокерских = (ЭтаФорма.Параметры.ИсполнителиБрокерские = Истина) Или (ЭтаФорма.Параметры.ИсполнителиБрокерские = 1);
	
	Элементы.СтраницаИсполнителиБрокерские.Видимость  = ЭтаФорма.ВыборИсполнителейБрокерских;
	Элементы.СтраницаИсполнителиСобственные.Видимость = Не ЭтаФорма.ВыборИсполнителейБрокерских;
	
	// изменим заголовок формы
	ЭтаФорма.Заголовок = ?(ЭтаФорма.ВыборИсполнителейБрокерских, "Брокерские", "Собственные") + " исполнители"
		+ ?(ПараметрыФормы.ВозвращатьВсеСведенияОбИсполнителе, "", ": выбор расчетного счета");
		
	РаботаСНастройкамиСписковКлиентСервер.УстановитьБыстрыеОтборы(ЭтаФорма, "ИсполнителиСобственные", "Организация,Период,СчетДоверительногоУправления", "Период", Истина);
	РаботаСНастройкамиСписковКлиентСервер.УстановитьБыстрыеОтборы(ЭтаФорма, "ИсполнителиБрокерские", "Организация,Период,СчетДоверительногоУправления,Брокер", "Период", Истина);
	
	// установим параметры дин. списков по исполнителям
	ЭтаФорма.ИсполнителиСобственные.Параметры.УстановитьЗначениеПараметра("ДатаЗакрытия", ?(ЗначениеЗаполнено(ЭтаФорма.Период), ЭтаФорма.Период, ТекущаяДата()));
	ЭтаФорма.ИсполнителиБрокерские.Параметры.УстановитьЗначениеПараметра("ДатаЗакрытия",  ?(ЗначениеЗаполнено(ЭтаФорма.Период), ЭтаФорма.Период, ТекущаяДата()));
	
	РаботаСНастройкамиСписковКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.ИсполнителиСобственные.Отбор, Новый Структура("ИмяПоля, Представление", "Закрыт", "ПредопределенныйОтборЗакрыт"),
		"ПредопределенныйОтборЗакрыт", ВидСравненияКомпоновкиДанных.Равно, Ложь, Не Элементы.ИсполнителиСобственныеКомандаИсполнителиСобственныеПоказатьСкрытьЗакрытых.Пометка, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто);
		
	РаботаСНастройкамиСписковКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.ИсполнителиБрокерские.Отбор, Новый Структура("ИмяПоля, Представление", "Закрыт", "ПредопределенныйОтборЗакрыт"),
		"ПредопределенныйОтборЗакрыт", ВидСравненияКомпоновкиДанных.Равно, Ложь, Не Элементы.ИсполнителиБрокерскиеКомандаИсполнителиБрокерскиеПоказатьСкрытьЗакрытых.Пометка, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто);
		
	// для полного списка установим отбор по юр/физ лицу, с учетом вида исполнителя
	Если Элементы.СтраницаПолныйСписок.Видимость Тогда
		РаботаСНастройкамиСписковКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ЮрФизЛицо",,,
			?(ЭтаФорма.ВыборИсполнителейБрокерских, ЭтаФорма.Брокер.ЮрФизЛицо, ЭтаФорма.Организация.ЮрФизЛицо));
	КонецЕсли;
	
КонецПроцедуры

#Область БЫСТРЫЙ_ОТБОР_ИСПОЛНИТЕЛИ_СОБСТВЕННЫЕ

&НаКлиенте
Процедура БыстрыйОтборИсполнителиСобственныеПериодПриИзменении(Элемент)
	
	ЭтаФорма.ИсполнителиСобственные.Параметры.УстановитьЗначениеПараметра("ДатаЗакрытия", ?(ЗначениеЗаполнено(ЭтаФорма.Период), ЭтаФорма.Период, ТекущаяДата()));
	
КонецПроцедуры

&НаКлиенте
Процедура БыстрыйОтборИсполнителиСобственныеСчетДоверительногоУправленияПриИзменении(Элемент)
	
	РаботаСНастройкамиСписковКлиентСервер.УстановитьЭлементОтбораСписка(ЭтаФорма, "ИсполнителиСобственные", "СчетДоверительногоУправления");
	
КонецПроцедуры

#КонецОбласти

#Область БЫСТРЫЙ_ОТБОР_ИСПОЛНИТЕЛИ_БРОКЕРСКИЕ

&НаКлиенте
Процедура БыстрыйОтборИсполнителиБрокерскиеПериодПриИзменении(Элемент)
	
	ЭтаФорма.ИсполнителиБрокерские.Параметры.УстановитьЗначениеПараметра("ДатаЗакрытия", ЭтаФорма.Период);
	
КонецПроцедуры

&НаКлиенте
Процедура БыстрыйОтборИсполнителиБрокерскиеСчетДоверительногоУправленияПриИзменении(Элемент)
	
	РаботаСНастройкамиСписковКлиентСервер.УстановитьЭлементОтбораСписка(ЭтаФорма, "ИсполнителиБрокерские", "СчетДоверительногоУправления");
	
КонецПроцедуры

&НаКлиенте
Процедура БыстрыйОтборИсполнителиБрокерскиеБрокерПриИзменении(Элемент)
	
	РаботаСНастройкамиСписковКлиентСервер.УстановитьЭлементОтбораСписка(ЭтаФорма, "ИсполнителиБрокерские", "Брокер");
	
	// для полного списка установим отбор по владельцу-брокеру
	Если Элементы.СтраницаПолныйСписок.Видимость Тогда
		РаботаСНастройкамиСписковКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ЮрФизЛицо",,,
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(?(ЭтаФорма.ВыборИсполнителейБрокерских, ЭтаФорма.Брокер, ЭтаФорма.Организация), "ЮрФизЛицо"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область КОМАНДЫ_ВЫБОРА

&НаКлиенте
Процедура КомандаВыбрать(Команда)
	
	ТекущаяСтраница = Элементы.ГруппаСтраницы.ТекущаяСтраница;
	
	Если      ТекущаяСтраница = Элементы.СтраницаИсполнителиБрокерские Тогда
		ИсполнителиБрокерскиеВыбор(Неопределено, Неопределено, Неопределено, Неопределено);
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаИсполнителиСобственные Тогда
		ИсполнителиСобственныеВыбор(Неопределено, Неопределено, Неопределено, Неопределено);
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаПолныйСписок Тогда
		СписокВыбор(Неопределено, Неопределено, Неопределено, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиБрокерскиеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные =  Элементы.ИсполнителиБрокерские.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		Если Не ЭтаФорма.Параметры.ВозвращатьВсеСведенияОбИсполнителе Тогда
			ОповеститьОВыборе(ТекущиеДанные.РасчетныйСчет);
		Иначе
			ВыбранныеДанные = Новый Структура("Брокер, СчетДоверительногоУправления, РасчетныйСчет");
			ЗаполнитьЗначенияСвойств(ВыбранныеДанные, ТекущиеДанные);
			ЭтаФорма.Закрыть(ВыбранныеДанные);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиСобственныеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ИсполнителиСобственные.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		Если Не ЭтаФорма.Параметры.ВозвращатьВсеСведенияОбИсполнителе Тогда
			ОповеститьОВыборе(ТекущиеДанные.РасчетныйСчет);
		Иначе
			ВыбранныеДанные = Новый Структура("СчетДоверительногоУправления, РасчетныйСчет");
			ЗаполнитьЗначенияСвойств(ВыбранныеДанные, ТекущиеДанные);
			ЭтаФорма.Закрыть(ВыбранныеДанные);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		ОповеститьОВыборе(Элементы.Список.ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура КомандаИсполнителиБрокерскиеПоказатьСкрытьЗакрытых(Команда)
	
	Элементы.ИсполнителиБрокерскиеКомандаИсполнителиБрокерскиеПоказатьСкрытьЗакрытых.Пометка = Не Элементы.ИсполнителиБрокерскиеКомандаИсполнителиБрокерскиеПоказатьСкрытьЗакрытых.Пометка;
	
	РаботаСНастройкамиСписковКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.ИсполнителиБрокерские.Отбор, Новый Структура("ИмяПоля, Представление", "Закрыт", "ПредопределенныйОтборЗакрыт"),
		"ПредопределенныйОтборЗакрыт", ВидСравненияКомпоновкиДанных.Равно, Ложь, Не Элементы.ИсполнителиБрокерскиеКомандаИсполнителиБрокерскиеПоказатьСкрытьЗакрытых.Пометка, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто);

	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИсполнителиСобственныеПоказатьСкрытьЗакрытых(Команда)
	
	Элементы.ИсполнителиСобственныеКомандаИсполнителиСобственныеПоказатьСкрытьЗакрытых.Пометка = Не Элементы.ИсполнителиСобственныеКомандаИсполнителиСобственныеПоказатьСкрытьЗакрытых.Пометка;
	
	РаботаСНастройкамиСписковКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.ИсполнителиСобственные.Отбор, Новый Структура("ИмяПоля, Представление", "Закрыт", "ПредопределенныйОтборЗакрыт"),
		"ПредопределенныйОтборЗакрыт", ВидСравненияКомпоновкиДанных.Равно, Ложь, Не Элементы.ИсполнителиСобственныеКомандаИсполнителиСобственныеПоказатьСкрытьЗакрытых.Пометка, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто);
	
КонецПроцедуры
